import cv2
#パーツのトリミング範囲を格納 x+420,y+110
parts_list = {"R1":(240,250,660,360),"R2":(240,366,660,476),"R3":(240,485,660,845),"R4":(185,1200,605,1300),"R5":(185,1320,605,1430),\
"R6":(380,1380,800,1490),"R7":(380,1500,800,1610),"R8":(1650,330,2070,440),"R9":(1410,1500,1830,1610),"R10":(1410,1610,1830,1720),\
"R11":(1530,1740,1950,1850)}

#画像読み込み
img = cv2.imread("./in_img/img_ic.jpg")

for i in range(1,12):
    print(parts_list[f"R{i}"])
    #スライス処理(トリミング
    #    [y1:y2, x1:x2]
    # img[top : bottom, left : right]左の形式に変換(x1=240,y1=250)(x2=660,y2=360)
    cv2.imwrite(f"./out_img/R{i}.png",\
    img[parts_list[f"R{i}"][1]:parts_list[f"R{i}"][3],parts_list[f"R{i}"][0]:parts_list[f"R{i}"][2]])

